// tslint:disable:max-line-length
export const ru = {
  shared: {
    platformName: 'OilCase',
    ok: 'Ok',
    save: 'Сохранить',
    cancel: 'Отменить',
    calculator: 'Калькулятор',
    download: 'Выгрузить кривые',
    logout: 'Выйти',
    profile: 'Профиль',
    traceBuild: 'Трассопостроение',
    trace: 'Трасса',
    settings: 'Настройки',
    experience: 'опыт',
    close: 'Закрыть',
    instruction: 'Инструкция',
    scatterPlot: 'Диаграмма рассеяния',
    core: 'Данные по керну',
    samplesNumber: 'N образцов',
    trendLine: 'тренд',
    editQuestionsForm: 'Редактировать опросную форму',
    explanation: 'Обоснование',
    maxDepth: 'Максимальная глубина',
    minDepth: 'Минимальная глубина',
    increaseScale: 'Увеличить масштаб планшета по вертикали',
    decreaseScale: 'Уменьшить масштаб планшета по вертикали',
    warningOnlyTenPercentFromCoreData: 'Можно выключить не более 10% от общего числа точек керна',
  },
  notification: {
    goToLink: 'Перейти по ссылке',
    link: 'https://docs.google.com/forms/d/e/1FAIpQLSf_KSTfYNNnFROdbhWsGLA861Rzvznu8zjIiJ7Cijv9oZsFCA/viewform',
  },
  curvesBrowser: {
    charts: 'Диаграммы',
    all: 'Все',
    forWholeApp: 'Для приложения',
    forThisTab: 'Для вкладки',
  },
  chart: {
    logarithmic: 'лог.',
    maxLimit: 'Ограничение оси Х справа',
    minLimit: 'Ограничение оси Х слева',
    limit: 'ограничить',
    changeColor: 'Сменить цвет',
  },
  noteChart: {
    comments: 'Комментарии',
    placeholder: 'Напишите текст сюда...',
    instructionMessage: 'Чтобы добавить комментарий для интервала нажмите на "+".',
  },
  structureChart: {
    structures: 'Текстуры',
    placeholder: 'Выберите...',
    instructionMessage: 'Чтобы добавить текстуру нажмите на "+".',
  },
  verticalBarChart: {
    grainSize: 'Размер частиц',
    placeholder: 'Напишите размер...',
    instructionMessage: 'Для добавления размера частиц для интервала нажмите на "+".',
  },
  editableList: {
    depth: 'Глубина',
    visibility: 'Вид.',
    value: 'Значение',
  },
  lithologySelectList: {
    shale: 'Глина',
    sand: 'Песчаник',
    coal: 'Уголь',
    shalySand: 'Песчаник глинистый',
    limestone: 'Известняк',
    siltstone: 'Алевролит',
  },
  warningMessages: {
    fieldsAreRequired: 'Нужно заполнить все поля',
    repeatIncorrect: 'Некорректно повторен новый пароль. Попробуйте еще разок.',
    needToBuildTrace: 'Не плохо бы построить трассу прежде чем идти далее.',
    problemWithChangeTab: 'Проблемка! 1. Вкладка перехода должна следовать очередности построенной трассы.'
      + ' 2. Можно переходить на сохраненные вкладки, если трасса была перестроена.'
      + ' 3. Текущая вкладка, с которой осуществляется переход, должна быть сохранена.'
      + ' 4. Вкладки до текущей должны быть отработаны и сохранены.',
  },
  features: {
    curvesDownload: {
      number: '№',
      curve: 'Кривая',
      calculatedCurvesForApp: 'Рассчитанные кривые для всего приложения',
      calculatedCurvesForTabs: 'Рассчитанные кривые для вкладок',
      otherCurves: 'Прочие кривые пользователя',
      downloadAll: 'Скачать все',
      noCurves: 'Нет кривых',
    },
    calculator: {
      calculatedCurves: 'Рассчитанные кривые',
      forWholeApp: 'Для всего приложения',
      forThisTab: 'Для открытой вкладки',
      selectForInsert: 'Выберите кривую или параметр для вставки в выражение',
      calculatedOnlyForThisTab: 'Рассчитать только для текущей вкладки',
      needToInsertEquation: 'Не плохо бы для начала ввести выражение, прежде чем нажимать кнопку "=" для рассчета кривой.',
      nameIsAlreadyExist: 'Кривая с таким именем уже существует в приложении. Поменяйте имя и попробуйте еще раз.',
      parenthesesBalance: 'Количество открывающих скобок должно соответствовать количеству закрывающих скобок.',
      instructionDisclaimer: 'Калькулятор не обладает искусственным интеллектом, поэтому не знает, что вы хотели ввести и о'
        + ' чем думаете, а понимает все введенное буквально, поэтому некорректный ввод формул может привести к некорректному'
        + ' расчету и в редких случаях - к зависанию приложения.',
      instructionLogicalOperatorsHeader: 'Логические операторы',
      instructionLogicalOperators: 'Для логических операций используются сиреневые кнопки. Ввод логических операций всегда'
        + ' предполагает полный ввод всех трех инструкций if(условие) then(если условие верно) и else(если условие не верно). Нельзя вводить'
        + ' частично, например только if и then. Тела инструкций должны быть в скобках всегда. Снаружи инструкций не должно быть'
        + ' никаких знаков. Например такой бред считаться не будет if((((GK<7) && (SP<105)) then (0.5+0.5) else (1-1)), потому что'
        + ' тело инструкции if находится в скобках, а здесь в скобках находится все выражение, стало быть блоки then() и else()'
        + ' отсутствуют. Правильно было бы if((GK<7) && (SP<105)) then (1) else (0). Кстати обратите внимание, что здесь в блоках'
        + ' то() и иначе() можно писать непосредственно значения, а не формулы для их расчета. Пояснения по логическим операторам.'
        + ' > - больше, >= - больше или равно, < - меньше, <= - меньше или равно, === - равно. Не в смысле "рассчитать", для этого есть'
        + ' кнопка CALC (рассчитать кривую), а в смысле булевого оператора равенства. Например условие (1+2) === (5-2) будет верным.'
        + ' !== - не равно (противоположен оператору ===), and(&&) - логически оператор И, является бинарным (то есть применяется'
        + ' к двум аргументам, а не сам по себе или к одному), выражение с ним истинно если оба условия истинны. Например сложное'
        + ' условие ((1+2) === (5-2)) && (1<2)) будет истинным. or(||) - логический оператор ИЛИ. Тоже бинарный. Общее условие с ним'
        + ' верно, если хотя бы одно из условий является истиной. Например условие ((1+2) === (5-2)) || (1>2)) будет истинным, так как'
        + ' первое условие истина, второе - ложь. Пример сложного условия:'
        + ' if ((DEPTH>=2620) && (DEPTH<=2650) && (IK>90) && ((3===3) || (1>2))) then (1) else (0). Во-первых здесь мы строим'
        + ' бинарный график, так как в блоках то() и иначе() только два значения: 0 и 1. Во-вторых мы здесь отсекаем нужные нам значения'
        + ' по глубине, так как условие (DEPTH>=2620) && (DEPTH<=2650) будет верным для интервала глубин от 2620 до 2650 включительно.'
        + ' В-третьих нас интересуют в данном интервале интервалы, где значение IK больше 90. В-четвертых поскольку последнее выражение'
        + ' сгруппировано скобками - мы смотрим выполнение одного из условий. Если нажать кнопку со знаком "?", то в строку выражения'
        + ' добавится выражение для примера.',
      instructionFunctionHeader: 'Функции',
      instructionFunction: '1. Аргументы всех функций (серые кнопки) должны быть в скобках, то есть можно SIN(90) и нельзя'
        + ' SIN90. 2. Пояснения по функциям. SIN - синус числа. COS - косинус числа. TAN - тангенс числа. Котангенс можно расчитать'
        + ' как 1/TAN. ABS - число по модулю. SQRT - квадратный корень числа. POW - возведение в степень. При этом слева - число'
        + ' возводимое в степень, справа - сама степень. Например (1,5+1,5)^2 (результат 9). ROUND - округление числа до целого'
        + ' по правилам математики. LOG - логарифм числа. При этом число указывается после функции, а основание до нее. Например'
        + ' логарифм числа 9 по основанию 3 равен 2. В калькуляторе: (3)log(9) (результат 2). LG - десятичный логарифм. LN -'
        + ' натуральный логарифм. Так же среди серых кнопок есть еще две - "\u03C0" и "e" - они просто добавляют числовые значения'
        + ' констант Пи (3.14) и e (основание натурального лагорифма ~2.7) в выражение.',
    },
    authorization: {
      wellcomeMessage: 'Добро пожаловать в платформу OilCase Online Practice!',
      login: 'Вход',
      email: 'Электронная почта',
      password: 'Пароль',
      signIn: 'Войти',
    },
    privateArea: {
      trace: 'На трассу',
      userData: 'Данные пользователя',
      name: 'Имя',
      surname: 'Фамилия',
      specialty: 'Специальность',
      course: 'Курс (REM / PE)',
      experience: 'Опыт интерпритации ГИС, лет',
      expectations: 'Что вы ожидаете от данного приложения?',
      changePassword: 'Изменить пароль',
      enterOldPassword: 'Введите старый пароль',
      enterNewPassword: 'Введите новый пароль',
      repeatNewPassword: 'Повторите новый пароль',
      change: 'Изменить',
      needToFillUserInfo: 'Не плохо бы заполнить данные о себе, прежде чем идти далее.',
      needBoth: 'Не плохо бы заполнить данные о себе и построить трассу прежде чем идти далее.',
      download: 'Нажмите, чтобы скачать',
      downloadHeader: 'Скачать входные данные',
    },
    traceBuild: {
      trace: 'На трассу',
      instructionMessage: 'Постройте трассу слева, перетаскивая блоки из колонки справа',
      clearTrack: 'Очистить трассу',
      saveTrack: 'Сохранить трассу',
      start: 'Старт',
      finish: 'Финиш',
    },
    reservoirsDefinition: {
      firstQuestion: 'Напишите, что по вашему мнению называется коллектором?',
      secondQuestion: 'Какие качественные признаки выделения коллекторов вы знаете? Напишите минимум 5.',
      instructionMessage: 'Рассчитайте новый дискретный график "Коллектор / не коллектор" используя условные'
        + ' операторы в Калькуляторе. Дискретность графика определяется автоматически, нужно просто задать'
        + ' условное выражение в Калькуляторе, в соответстивии с которым определяется наличие коллектора и его отсутствие.'
        + ' После расчета вы можете визуализировать его, используя чекбоксы в столбце справа.',
    },
    lithology: {
      lithology: 'Литология',
      choose: 'Выберите...',
      instructionMessage: 'Чтобы заполнить столбец литологии, вначале установите уровни литологии,'
        + ' кликая на нужной глубине на графиках слева. Затем нажмите на "+" и добавьте интервалы'
        + ' литологии. После добавления интервалов, отредактируйте их, нажимая на кнопку'
        + ' редактирования (с карандашом) в каждом интервале. Можно удалить сразу все уровни'
        + ' и интервалы литологии, нажав вторую кнопку рядом с "+" в заголовке данного столбца.'
        + ' Либо удалять только уровни выборочно, нажимая на "x" в подписи каждого уровня в'
        + ' столбце глубины.',
    },
    shaliness: {
      shaliness: 'Глинистость',
      sandLine: 'линия песков',
      shaleLine: 'линия глин',
      instructionMessage: 'Кликайте по графикам слева. Первый клик по любому из графиков в'
        + ' нужном месте устанавливает линию глин, второй клик - линию песков. Удалить все'
        + ' уровни сразу можно нажав на кнопку рядом с заголовком данного столбца. Либо'
        + ' каждый уровень по отдельности, нажимая "X". Итогом работы в разделе должна быть кривая'
        + ' глинистости, рассчитанная для вкладки и перед сохранением должна быть единственной'
        + ' визуализированной (так как нужна будет в дальнейших рассчетах).',
    },
    baseParameters: {
      baseParameters: 'Рассчет базовых параметров',
      addParameter: 'Добавить параметр',
      name: 'Имя',
      value: 'Значение',
      calculationLink: 'Ссылка на файл расчета',
      comments: 'Комментарий',
      message: 'Опишите подход, который был использован при расчете данного параметра. Для чего нужен этот параметр?',
      warningMessage: 'Надо заполнить все поля параметров и удалить параметры с незаполненными полями, прежде чем сохранять.',
    },
    porosity: {
      instructionMessage: 'Сначала нужно рассчитать несколько кривых пористости по предполагаемому закону в Калькуляторе.'
        + ' Расчет кривых должен быть в процентах, так как точки пористости по керну имеют процентные значения.'
        + ' После того как кривые будут рассчитаны их можно выбирать в столбце справа для просмотра.'
        + ' Выбирая кривые, необходимо подобрать кривую, которая максимально корректно описывает лабораторные данные пористости'
        + ' по крену. Данные пористости по керну визуализируются самостоятельно. Как только оптимальная кривая будет'
        + ' подобрана, нужно оставить визуализированной именно её.',
    },
    waterSaturation: {
      instructionMessage: 'Сначала нужно рассчитать несколько кривых водонасыщенности по предполагаемому закону в Калькуляторе.'
        + ' Расчет кривых должен быть в процентах, так как точки водонасыщенности по керну имеют процентные значения.'
        + ' После того как кривые будут рассчитаны их можно выбирать в столбце справа для просмотра.'
        + ' Выбирая кривые, необходимо подобрать кривую, которая максимально корректно описывает лабораторные данные водонасыщенности'
        + ' по крену. Данные водонасыщенности по керну визуализируются самостоятельно. Как только оптимальная кривая будет'
        + ' подобрана, нужно оставить визуализированной именно её.',
    },
    permeability: {
      instructionMessage: 'Сначала нужно рассчитать несколько кривых проницаемости по предполагаемому закону в Калькуляторе.'
        + ' Расчет кривых должен быть в миллидарси. После того как кривые будут рассчитаны их можно выбирать в столбце справа'
        + ' для просмотра. Выбирая кривые, необходимо подобрать кривую, которая максимально корректно описывает лабораторные'
        + ' данные проницаемости по крену. Данные проницаемости по керну визуализируются самостоятельно. Как только оптимальная'
        + ' кривая будет подобрана, нужно оставить визуализированной именно её.',
    },
    cutOffs: {
      shaliness: 'Глинистость',
      gs: 'МП',
      porosity: 'Пористость',
      nt: 'МК',
      waterSaturation: 'Водонас-cть',
      gop: 'МНК',
      permeability: 'Прониц-сть',
      gp: 'МПК',
      np: 'МЭНК',
      inputValues: 'Вводимые значения',
      calculatedValues: 'Расчетные значения',
      apply: 'Применить',
      shaleCutOff: 'Граничное значение глинистости',
      porosityCutOff: 'Граничное значение пористости',
      waterSaturationCutOff: 'Граничное значение водонасыщенности',
      permeabilityCutOff: 'Граничное значение проницаемости',
      grossSand: 'Мощность песчанника (МП), м',
      netThickness: 'Мощность коллектора (МК), м',
      grossOilPay: 'Мощность нефтенасыщенного коллектора (МНК), м',
      grossPay: 'Мощность проницаемого коллектора (МПК), м',
      netPay: 'Мощность эффективного нефтенасыщенного коллектора (МЭНК, автоматически, на основе четырех предыдущих), м',
      grossInterval: 'Общая мощность (автоматически на основе выделенных ранее коллекторов), м',
      instructionMessage: '1. Кривые глинистости, пористости, водонасыщенности, проницаемости беруться автоматически из пройденнх'
        + ' ранее разделов. 2. Если колонки с данными кривыми пустые - это значит что вы их не рассчитали на предыдущих шагах,'
        + ' либо не отметили кривые (не визуализировали) при сохранении вкладки. 3. В случае если вы визуализируете несколько кривых'
        + ' - будет браться первая из визуализированных. 4. Для того чтобы отработать данный раздел и подтянуть необходимые кривые -'
        + ' нужно перестроить трассу и пройти соответствующие разделы. 5. Общая мощность берется автоматически из раздела по определению'
        + ' резервуаров, если его нет до текущей вкладки - нужно так же перестроить трассу. Будет браться первая из визуализированных'
        + ' дискретных кривых. 6. Для построения мощностей - нажимать кнопку применить. 7. Если граничное значение не задано - поле'
        + ' должно быть пустым, так как 0 так же является значением и участвует в рассчетах.',
    },
    fluidsType: {
      fluid: 'Флюид',
      question: 'Как определить тип флюида, который заполняет поровое пространство коллектора?',
      instructionMessage: 'Чтобы заполнить столбец флюида, вначале установите уровни границ флюидов, кликая на нужной'
        + ' глубине на графиках слева. Затем нажмите на "+" и добавьте интервалы флюидов. После добавления интервалов,'
        + ' отредактируйте их, нажимая на кнопку редактирования (с карандашом) в каждом интервале. Можно удалить сразу'
        + ' все уровни границ и интервалы флюидов, нажав вторую кнопку рядом с "+" в заголовке данного столбца. Либо'
        + ' удалять только уровни выборочно, нажимая на "x" в подписи каждого уровня в столбце глубины. Так же не забудте'
        + ' заполнить столбец с обоснованием для каждого интервала правее.',
      secondInstructionMessage: 'Интервалы берутся автоматически из столбца слева. Просто отредактируйте содержание интервалов.',
      selectorPlaceholder: 'Выберите тип уровня...',
      fluidBoundaryLevel: 'Уровень границы флюида',
      oilWaterContactLevel: 'Уровень ВНК',
      gasOilContactLevel: 'Уровень ГНК',
      oil: 'Нефть',
      water: 'Вода',
      oilWithWater: 'Нефть с водой',
      waterWithOil: 'Вода с нефтью',
      owc: 'ВНК',
      goc: 'ГНК',
    },
    perforationIntervals: {
      perforation: 'Перфорация',
      perforationInterval: 'Инт. перф.',
      question: 'На что влияет положение интервалов перфорации в действующих скважинах?',
      instructionMessage: 'Чтобы заполнить столбец интервалов перфорации, вначале установите уровни границ интервалов'
        + ' перфорации, кликая на нужной глубине на графиках слева. Затем нажмите на "+" и добавьте пустые интервалы.'
        + ' После добавления интервалов, отредактируйте необходимый интервал, нажимая на кнопку редактирования'
        + ' (с карандашом). Можно удалить сразу все уровни границ и интервалы перфорации, нажав вторую кнопку рядом с'
        + ' "+" в заголовке данного столбца. Либо удалять только уровни выборочно, нажимая на "x" в подписи каждого уровня'
        + ' в столбце глубины. Так же не забудте заполнить столбец с обоснованием для каждого интервала правее.',
      secondInstructionMessage: 'Интервалы берутся автоматически из столбца слева. Просто отредактируйте содержание'
        + ' интервалов.',
    },
    depositionalEnvironment: {
      coreLithology: 'Литология керн',
      grainSize: 'Размер частиц',
      depositionalStructures: 'Текстурный анализ',
      coreDescription: 'Описание керна',
      instructionMessage: 'Чтобы добавить интервал литологии нажмите на "+".',
      secondInstructionMessage: 'Интервалы берутся автоматически из литологии по керну. Просто отредактируйте содержание'
        + ' каждого интервала.',
      thirdInstructionMessage: 'Опишите ниже обстановку осадконакопления, в которой сформировалось ваше песчаное тело.'
        + ' Обоснуйте свой ответ. Так же оставьте ссылку на рисунок на стороннем сервисе*. ',
      result: 'Итог',
      bioturbationStructures: 'Структуры биотурбации',
      climbingCurrentRipples: 'Восходящая рябь',
      crossBedding: 'Косая слоистость',
      currentRipples: 'Рябь течений',
      doubleMudDrapes: 'Двойные глинистые слойки',
      escapeStructures: 'Текстуры убегания',
      flameStructures: 'Пламенная текстура',
      flatLamination: 'Горизонтальная слоистость',
      flazerBedding: 'Флазерная слоистость',
      fluidMuds: 'Жидкие илы',
      gradatedBedding: 'Градационная слоистость',
      hcs: 'Слоистость, образованная штормами',
      lenticularBedding: 'Тонко-линзовидная слоистость',
      loadCast: 'Текстуры деформации в результате оползания / взмучивания осадка',
      softSedimentDeformation: 'Текстуры деформации',
      troughCrossBedding: 'Троговая',
      waveRipples: 'Волновая рябь',
      wavyLamination: 'Волнистая слоистость',
      incorrectInterval: 'Не корректно введены границы интервала',
    },
    analogueField: {
      whatIsAnalogueField: 'Что такое месторождение аналог? Напишите свое понимание этого термина.',
      whatIsMainParametrs: 'Какие параметры являются ключевыми при выборе месторождения аналога?',
      whatIsUsefulInfo: 'Какую полезную информацию можно извлечь из месторождения аналога?',
      analogueFieldName: 'Введите название месторождения аналога для вашего объекта.',
      explanation: 'Объясните свой выбор ниже.',
      gisScreenshotLink: 'Оставьте ниже ссылку(и) на скриншот кривой ГИС, которая описывает физические'
        + ' свойства коллектора на месторождении аналоге.',
      sourcesLink: 'Оставьте ниже ссылку(и) на литературные источники, которые описывают месторождение аналог.',
    },
    summarySection: {
      resultLogView: 'Итоговый планшет',
      createResultLog: 'Составьте итоговый планшет для заказчика, отмечая нужные данные в столбце справа.',
      calculationsAndRecommendations: 'Подсчет запасов и рекомендации по разработке',
      writeSomeRecommendations: 'Оставьте свои рекомендации по разработке и соображения по запасам нефти.',
      expand: 'Развернуть',
      collapse: 'Свернуть',
      recommendations: 'Ваши рекомендации по разработке месторождения:*',
      stoiip: 'Оцените запасы, млн. тонн в стандартных условиях:',
      recoveryFactor: 'КИН:',
      oilPrice: 'Цена на нефть, рублей за баррель:',
      profit: 'Нефтяная компания получит прибыль, тысяч рублей:',
      warning: 'Этот пункт исходя из названия должен быть последним на трассе. Как вы полагаете? Если согласны'
        + ' - перестройте трассу.',
      lithologyDataSource: 'Данные берутся из вкладки по определению литологии.',
      fluid: 'Флюид',
      fluidDataSource: 'Данные берутся из вкладки по определению типа флюида и ВНК.',
      perforation: 'Перфорация',
      perforationDataSource: 'Данные берутся из вкладки по определению интервалов перфорации.',
      congratulations: 'Поздравляем! Вы прошли всю трассу. А правильно или нет покажет проверка. Мы хотим совершенствовать'
      + ' наше приложение, поэтому нам очень важно ваше мнение о нем. Пожалуйста, оставьте свой отзыв, заполнив анкету'
      + ' по ссылке https://docs.google.com/forms/d/e/1FAIpQLSf_KSTfYNNnFROdbhWsGLA861Rzvznu8zjIiJ7Cijv9oZsFCA/viewform'
      + ' Спасибо за участие!',
    },
  },
  tabs: {
    reservoirIntervals: { text: 'Выделение коллекторов', altText: 'Выделение коллекторов' },
    lithology: { text: 'Определение литологии', altText: 'Литология' },
    shaliness: { text: 'Расчет глинистости', altText: 'Глинистость' },
    porosity: { text: 'Расчет пористости', altText: 'Пористость' },
    waterSaturation: { text: 'Расчет водонасыщенности', altText: 'Водонасыщенность' },
    permeability: { text: 'Расчет проницаемости', altText: 'Проницаемость' },
    cutOffs: { text: 'Расчет граничных значений', altText: 'Граничные значения' },
    baseParameters: { text: 'Расчет базовых параметров (a, m, n, Rw)', altText: 'Базовые параметры' },
    fluidsType: { text: 'Определение типа флюида и ВНК', altText: 'Тип флюида и ВНК' },
    perforationIntervals: { text: 'Определение интервалов перфорации', altText: 'Интервалы перфорации' },
    analogueField: { text: 'Подбор месторождения аналога', altText: 'Месторождение аналог' },
    depositionalEnvironment: { text: 'Определение обстановки осадконакопления', altText: 'Обстановка осадконакопления' },
    conclusions: {
      text: 'Заключение и рекомендации. Отправка результатов заказчику',
      altText: 'Заключение, рекомендации и отправка результатов',
    },
  },
};
