const QUESTIONS = [
  'Что такое месторождение аналог? Напишите свое понимание этого термина.',
  'Какие параметры являются ключевыми при выборе месторождения аналога?',
  'Какую полезную информацию можно извлечь из месторождения аналога?',
  'Введите название месторождения аналога для вашего объекта.',
  'Объясните свой выбор ниже.',
  'Оставьте ниже ссылку(и) на скриншот кривой ГИС, которая описывает физические свойства коллектора на месторождении аналоге.',
  'Оставьте ниже ссылку(и) на литературные источники, которые описывают месторождение аналог.',
];

const QUESTIONS_TRANSLATION_KEYS = [
  'whatIsAnalogueField',
  'whatIsMainParametrs',
  'whatIsUsefulInfo',
  'analogueFieldName',
  'explanation',
  'gisScreenshotLink',
  'sourcesLink',
];

export { QUESTIONS, QUESTIONS_TRANSLATION_KEYS };
